**Задача: Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа. 
Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. 
При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами**

## Первоначальный массив

Первым шагом создаем с помощью метода 

    string [] InitArray ()

первоначальный массив, значения элементов которого может ввести пользователь. Сначала запрашиваем у пользователя размер массива, считываем результат из консоли и вводим переменную *count* под данное значение:

    Console.Write("Введите количество элементов массива:\t");

    int count = int.Parse(Console.ReadLine());

Далее создаем массив заданной длины, заполненный нулями:

    string[] enteredArray = new string[count];

И с помощью цикла *for* "шагаем" по массиву и заполняем элементы знвчениями, которые также запрашиваем у пользователя и считываем из консоли:

    for (int i = 0; i < enteredArray.Length; i++)
    {
        Console.Write($"Введите элемент массива по индексом {i}:\t ");
        enteredArray[i] = Console.ReadLine();
    }

Возвращаем из метода созданный массив с помощью:

    return enteredArray;


## Печать массива

Напечатать масссив можно с помощью метода:
    
    void PrintArray(string[] enteredArray)

В методе мы так же "шагая" по массиву с помощью цикла *for* выводимы значения элементов в консоль:

    for (int i = 0; i < enteredArray.Length; i++)
    {
        Console.Write($"{enteredArray[i]} ");
    }

## Создание итогового массива, заполненного необходимыми элементами

Данный шаг выполняеися в методе

    string [] NewArray (string [] result)

Внутри метода создаем новый массив

    string[] newArray = new string[result.Length];

и вводим переменную *j* , котороая соответствует индексу нового массива.
С помощью цикла *for* "шагаем" по первоначальному массиву и ищем элементы необходимой длины при помощи условия:

    if (result[i].Length <= 3)

Найденные значения элементов записываем в значения элементов нового массива:

    newArray[j] = result[i];

и увеличиваем значение индекса:

    j++;

Возвращаем из метода новый массив с помощью:

    return newArray;

## Вызов методов

Все методы вызываются в том порядке, в котором они должны выполняться:

    string [] result = InitArray ();
    PrintArray(result);
    string [] finalArray = NewArray (result);
    PrintArray(finalArray);

    
